---
kind: method
id: M:Autodesk.Revit.DB.ParameterMap.GetEnumerator
source: html/13fdc090-378b-7ba0-9498-bd1c1f27e80b.htm
---
# Autodesk.Revit.DB.ParameterMap.GetEnumerator Method

Retrieve a forward moving iterator to the map.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the map.